Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/drmtcm.h
/* -------- DRMTCM_IFLTADR : (DRMTCM Offset: 0x20) (R/W 32) ITCM FAULT INJECTION ADDRESS REGISTER -------- */
#define DRMTCM_IFLTADR_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_IFLTADR) ITCM FAULT INJECTION ADDRESS REGISTER  Reset Value */

#define DRMTCM_IFLTADR_IFLTADR_Pos            _UINT32_(0)                                          /* (DRMTCM_IFLTADR) Instruction ITCM ECC Fault Injection, Address Match Com-pare bits. Position */
#define DRMTCM_IFLTADR_IFLTADR_Msk            (_UINT32_(0x1FFFF) << DRMTCM_IFLTADR_IFLTADR_Pos)    /* (DRMTCM_IFLTADR) Instruction ITCM ECC Fault Injection, Address Match Com-pare bits. Mask */
#define DRMTCM_IFLTADR_IFLTADR(value)         (DRMTCM_IFLTADR_IFLTADR_Msk & (_UINT32_(value) << DRMTCM_IFLTADR_IFLTADR_Pos)) /* Assigment of value for IFLTADR in the DRMTCM_IFLTADR register */
#define DRMTCM_IFLTADR_Msk                    _UINT32_(0x0001FFFF)                                 /* (DRMTCM_IFLTADR) Register Mask  */


/* -------- DRMTCM_IFLTCAP : (DRMTCM Offset: 0x24) ( R/ 32) ITCM FAULT ERROR CAPTURE ADDRESS REGISTER -------- */
#define DRMTCM_IFLTCAP_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_IFLTCAP) ITCM FAULT ERROR CAPTURE ADDRESS REGISTER  Reset Value */

#define DRMTCM_IFLTCAP_FLTADR_Pos             _UINT32_(0)                                          /* (DRMTCM_IFLTCAP) Instruction TCM ECC Fault Address bits which caused the ECC Error. Position */
#define DRMTCM_IFLTCAP_FLTADR_Msk             (_UINT32_(0x1FFFF) << DRMTCM_IFLTCAP_FLTADR_Pos)     /* (DRMTCM_IFLTCAP) Instruction TCM ECC Fault Address bits which caused the ECC Error. Mask */
#define DRMTCM_IFLTCAP_FLTADR(value)          (DRMTCM_IFLTCAP_FLTADR_Msk & (_UINT32_(value) << DRMTCM_IFLTCAP_FLTADR_Pos)) /* Assigment of value for FLTADR in the DRMTCM_IFLTCAP register */
#define DRMTCM_IFLTCAP_ITCMMASTER_Pos         _UINT32_(28)                                         /* (DRMTCM_IFLTCAP) Master ID of the requester of the current Error access. Position */
#define DRMTCM_IFLTCAP_ITCMMASTER_Msk         (_UINT32_(0xF) << DRMTCM_IFLTCAP_ITCMMASTER_Pos)     /* (DRMTCM_IFLTCAP) Master ID of the requester of the current Error access. Mask */
#define DRMTCM_IFLTCAP_ITCMMASTER(value)      (DRMTCM_IFLTCAP_ITCMMASTER_Msk & (_UINT32_(value) << DRMTCM_IFLTCAP_ITCMMASTER_Pos)) /* Assigment of value for ITCMMASTER in the DRMTCM_IFLTCAP register */
#define DRMTCM_IFLTCAP_Msk                    _UINT32_(0xF001FFFF)                                 /* (DRMTCM_IFLTCAP) Register Mask  */


/* -------- DRMTCM_IFLTPAR : (DRMTCM Offset: 0x28) ( R/ 32) ITCM FAULT PARITY REGISTER -------- */
#define DRMTCM_IFLTPAR_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_IFLTPAR) ITCM FAULT PARITY REGISTER  Reset Value */

#define DRMTCM_IFLTPAR_SECIN_Pos              _UINT32_(0)                                          /* (DRMTCM_IFLTPAR) Single Error Parity Bits from ITCM Position */
#define DRMTCM_IFLTPAR_SECIN_Msk              (_UINT32_(0xFF) << DRMTCM_IFLTPAR_SECIN_Pos)         /* (DRMTCM_IFLTPAR) Single Error Parity Bits from ITCM Mask */
#define DRMTCM_IFLTPAR_SECIN(value)           (DRMTCM_IFLTPAR_SECIN_Msk & (_UINT32_(value) << DRMTCM_IFLTPAR_SECIN_Pos)) /* Assigment of value for SECIN in the DRMTCM_IFLTPAR register */
#define DRMTCM_IFLTPAR_Msk                    _UINT32_(0x000000FF)                                 /* (DRMTCM_IFLTPAR) Register Mask  */


/* -------- DRMTCM_IFLTSYN : (DRMTCM Offset: 0x2C) ( R/ 32) ITCM FAULT ECC SYNDROME REGISTER -------- */
#define DRMTCM_IFLTSYN_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_IFLTSYN) ITCM FAULT ECC SYNDROME REGISTER  Reset Value */

#define DRMTCM_IFLTSYN_SECSYN_Pos             _UINT32_(0)                                          /* (DRMTCM_IFLTSYN) Single Error Syndrome Position */
#define DRMTCM_IFLTSYN_SECSYN_Msk             (_UINT32_(0xFF) << DRMTCM_IFLTSYN_SECSYN_Pos)        /* (DRMTCM_IFLTSYN) Single Error Syndrome Mask */
#define DRMTCM_IFLTSYN_SECSYN(value)          (DRMTCM_IFLTSYN_SECSYN_Msk & (_UINT32_(value) << DRMTCM_IFLTSYN_SECSYN_Pos)) /* Assigment of value for SECSYN in the DRMTCM_IFLTSYN register */
#define DRMTCM_IFLTSYN_ERR1_Pos               _UINT32_(14)                                         /* (DRMTCM_IFLTSYN) Single Bit Error Position */
#define DRMTCM_IFLTSYN_ERR1_Msk               (_UINT32_(0x1) << DRMTCM_IFLTSYN_ERR1_Pos)           /* (DRMTCM_IFLTSYN) Single Bit Error Mask */
#define DRMTCM_IFLTSYN_ERR1(value)            (DRMTCM_IFLTSYN_ERR1_Msk & (_UINT32_(value) << DRMTCM_IFLTSYN_ERR1_Pos)) /* Assigment of value for ERR1 in the DRMTCM_IFLTSYN register */
#define DRMTCM_IFLTSYN_ERR2_Pos               _UINT32_(15)                                         /* (DRMTCM_IFLTSYN) Double bit Error Position */
#define DRMTCM_IFLTSYN_ERR2_Msk               (_UINT32_(0x1) << DRMTCM_IFLTSYN_ERR2_Pos)           /* (DRMTCM_IFLTSYN) Double bit Error Mask */
#define DRMTCM_IFLTSYN_ERR2(value)            (DRMTCM_IFLTSYN_ERR2_Msk & (_UINT32_(value) << DRMTCM_IFLTSYN_ERR2_Pos)) /* Assigment of value for ERR2 in the DRMTCM_IFLTSYN register */
#define DRMTCM_IFLTSYN_Msk                    _UINT32_(0x0000C0FF)                                 /* (DRMTCM_IFLTSYN) Register Mask  */

#define DRMTCM_IFLTSYN_ERR_Pos                _UINT32_(14)                                         /* (DRMTCM_IFLTSYN Position) Double bit Error */
#define DRMTCM_IFLTSYN_ERR_Msk                (_UINT32_(0x3) << DRMTCM_IFLTSYN_ERR_Pos)            /* (DRMTCM_IFLTSYN Mask) ERR */
#define DRMTCM_IFLTSYN_ERR(value)             (DRMTCM_IFLTSYN_ERR_Msk & (_UINT32_(value) << DRMTCM_IFLTSYN_ERR_Pos)) 

/* -------- DRMTCM_DFLTPTR : (DRMTCM Offset: 0x30) (R/W 32) DTCM FAULT INJECTION POINTER REGISTER -------- */
#define DRMTCM_DFLTPTR_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_DFLTPTR) DTCM FAULT INJECTION POINTER REGISTER  Reset Value */

#define DRMTCM_DFLTPTR_FLT1PTR_Pos            _UINT32_(0)                                          /* (DRMTCM_DFLTPTR) ECC Fault injection Bit position pointer (for single bit error). Position */
#define DRMTCM_DFLTPTR_FLT1PTR_Msk            (_UINT32_(0x3F) << DRMTCM_DFLTPTR_FLT1PTR_Pos)       /* (DRMTCM_DFLTPTR) ECC Fault injection Bit position pointer (for single bit error). Mask */
#define DRMTCM_DFLTPTR_FLT1PTR(value)         (DRMTCM_DFLTPTR_FLT1PTR_Msk & (_UINT32_(value) << DRMTCM_DFLTPTR_FLT1PTR_Pos)) /* Assigment of value for FLT1PTR in the DRMTCM_DFLTPTR register */
#define DRMTCM_DFLTPTR_FLT2PTR_Pos            _UINT32_(16)                                         /* (DRMTCM_DFLTPTR) ECC Fault injection Bit position pointer (for double bit error). Position */
#define DRMTCM_DFLTPTR_FLT2PTR_Msk            (_UINT32_(0x3F) << DRMTCM_DFLTPTR_FLT2PTR_Pos)       /* (DRMTCM_DFLTPTR) ECC Fault injection Bit position pointer (for double bit error). Mask */
#define DRMTCM_DFLTPTR_FLT2PTR(value)         (DRMTCM_DFLTPTR_FLT2PTR_Msk & (_UINT32_(value) << DRMTCM_DFLTPTR_FLT2PTR_Pos)) /* Assigment of value for FLT2PTR in the DRMTCM_DFLTPTR register */
#define DRMTCM_DFLTPTR_Msk                    _UINT32_(0x003F003F)                                 /* (DRMTCM_DFLTPTR) Register Mask  */


/* -------- DRMTCM_DFLTADR : (DRMTCM Offset: 0x34) (R/W 32) DTCM FAULT INJECTION ADDRESS REGISTER -------- */
#define DRMTCM_DFLTADR_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_DFLTADR) DTCM FAULT INJECTION ADDRESS REGISTER  Reset Value */

