Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/drmtcm.h
#define DRMTCM_DFLTADR_FLTADR_Pos             _UINT32_(0)                                          /* (DRMTCM_DFLTADR) Data TCM ECC Fault Injection, Address Match Compare bits. Position */
#define DRMTCM_DFLTADR_FLTADR_Msk             (_UINT32_(0x1FFFF) << DRMTCM_DFLTADR_FLTADR_Pos)     /* (DRMTCM_DFLTADR) Data TCM ECC Fault Injection, Address Match Compare bits. Mask */
#define DRMTCM_DFLTADR_FLTADR(value)          (DRMTCM_DFLTADR_FLTADR_Msk & (_UINT32_(value) << DRMTCM_DFLTADR_FLTADR_Pos)) /* Assigment of value for FLTADR in the DRMTCM_DFLTADR register */
#define DRMTCM_DFLTADR_D1D0EN_Pos             _UINT32_(31)                                         /* (DRMTCM_DFLTADR) Fault Injection D1 or D0 Address Enable. Position */
#define DRMTCM_DFLTADR_D1D0EN_Msk             (_UINT32_(0x1) << DRMTCM_DFLTADR_D1D0EN_Pos)         /* (DRMTCM_DFLTADR) Fault Injection D1 or D0 Address Enable. Mask */
#define DRMTCM_DFLTADR_D1D0EN(value)          (DRMTCM_DFLTADR_D1D0EN_Msk & (_UINT32_(value) << DRMTCM_DFLTADR_D1D0EN_Pos)) /* Assigment of value for D1D0EN in the DRMTCM_DFLTADR register */
#define DRMTCM_DFLTADR_Msk                    _UINT32_(0x8001FFFF)                                 /* (DRMTCM_DFLTADR) Register Mask  */


/* -------- DRMTCM_D0FLTCAP : (DRMTCM Offset: 0x38) ( R/ 32) D0TCM FAULT ERROR CAPTURE ADDRESS REGISTER -------- */
#define DRMTCM_D0FLTCAP_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_D0FLTCAP) D0TCM FAULT ERROR CAPTURE ADDRESS REGISTER  Reset Value */

#define DRMTCM_D0FLTCAP_FLTADR_Pos            _UINT32_(0)                                          /* (DRMTCM_D0FLTCAP) Data 0 TCM ECC Fault Address bits which caused the ECC Error. Position */
#define DRMTCM_D0FLTCAP_FLTADR_Msk            (_UINT32_(0x1FFFF) << DRMTCM_D0FLTCAP_FLTADR_Pos)    /* (DRMTCM_D0FLTCAP) Data 0 TCM ECC Fault Address bits which caused the ECC Error. Mask */
#define DRMTCM_D0FLTCAP_FLTADR(value)         (DRMTCM_D0FLTCAP_FLTADR_Msk & (_UINT32_(value) << DRMTCM_D0FLTCAP_FLTADR_Pos)) /* Assigment of value for FLTADR in the DRMTCM_D0FLTCAP register */
#define DRMTCM_D0FLTCAP_TCMMASTER_Pos         _UINT32_(28)                                         /* (DRMTCM_D0FLTCAP) Master ID of the requester of the current Error access. Position */
#define DRMTCM_D0FLTCAP_TCMMASTER_Msk         (_UINT32_(0xF) << DRMTCM_D0FLTCAP_TCMMASTER_Pos)     /* (DRMTCM_D0FLTCAP) Master ID of the requester of the current Error access. Mask */
#define DRMTCM_D0FLTCAP_TCMMASTER(value)      (DRMTCM_D0FLTCAP_TCMMASTER_Msk & (_UINT32_(value) << DRMTCM_D0FLTCAP_TCMMASTER_Pos)) /* Assigment of value for TCMMASTER in the DRMTCM_D0FLTCAP register */
#define DRMTCM_D0FLTCAP_Msk                   _UINT32_(0xF001FFFF)                                 /* (DRMTCM_D0FLTCAP) Register Mask  */


/* -------- DRMTCM_D0FLTPAR : (DRMTCM Offset: 0x3C) ( R/ 32) D0TCM FAULT PARITY REGISTER -------- */
#define DRMTCM_D0FLTPAR_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_D0FLTPAR) D0TCM FAULT PARITY REGISTER  Reset Value */

#define DRMTCM_D0FLTPAR_SECIN_Pos             _UINT32_(0)                                          /* (DRMTCM_D0FLTPAR) Single Error Parity Bits from D0TCM Position */
#define DRMTCM_D0FLTPAR_SECIN_Msk             (_UINT32_(0x7F) << DRMTCM_D0FLTPAR_SECIN_Pos)        /* (DRMTCM_D0FLTPAR) Single Error Parity Bits from D0TCM Mask */
#define DRMTCM_D0FLTPAR_SECIN(value)          (DRMTCM_D0FLTPAR_SECIN_Msk & (_UINT32_(value) << DRMTCM_D0FLTPAR_SECIN_Pos)) /* Assigment of value for SECIN in the DRMTCM_D0FLTPAR register */
#define DRMTCM_D0FLTPAR_Msk                   _UINT32_(0x0000007F)                                 /* (DRMTCM_D0FLTPAR) Register Mask  */


/* -------- DRMTCM_D0FLTSYN : (DRMTCM Offset: 0x40) ( R/ 32) D0TCM FAULT ECC SYNDROME REGISTER -------- */
#define DRMTCM_D0FLTSYN_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_D0FLTSYN) D0TCM FAULT ECC SYNDROME REGISTER  Reset Value */

#define DRMTCM_D0FLTSYN_SECSYN_Pos            _UINT32_(0)                                          /* (DRMTCM_D0FLTSYN) Single Error Syndrome Position */
#define DRMTCM_D0FLTSYN_SECSYN_Msk            (_UINT32_(0x7F) << DRMTCM_D0FLTSYN_SECSYN_Pos)       /* (DRMTCM_D0FLTSYN) Single Error Syndrome Mask */
#define DRMTCM_D0FLTSYN_SECSYN(value)         (DRMTCM_D0FLTSYN_SECSYN_Msk & (_UINT32_(value) << DRMTCM_D0FLTSYN_SECSYN_Pos)) /* Assigment of value for SECSYN in the DRMTCM_D0FLTSYN register */
#define DRMTCM_D0FLTSYN_ERR1_Pos              _UINT32_(14)                                         /* (DRMTCM_D0FLTSYN) Single Bit Error Position */
#define DRMTCM_D0FLTSYN_ERR1_Msk              (_UINT32_(0x1) << DRMTCM_D0FLTSYN_ERR1_Pos)          /* (DRMTCM_D0FLTSYN) Single Bit Error Mask */
#define DRMTCM_D0FLTSYN_ERR1(value)           (DRMTCM_D0FLTSYN_ERR1_Msk & (_UINT32_(value) << DRMTCM_D0FLTSYN_ERR1_Pos)) /* Assigment of value for ERR1 in the DRMTCM_D0FLTSYN register */
#define DRMTCM_D0FLTSYN_ERR2_Pos              _UINT32_(15)                                         /* (DRMTCM_D0FLTSYN) Double bit Error Position */
#define DRMTCM_D0FLTSYN_ERR2_Msk              (_UINT32_(0x1) << DRMTCM_D0FLTSYN_ERR2_Pos)          /* (DRMTCM_D0FLTSYN) Double bit Error Mask */
#define DRMTCM_D0FLTSYN_ERR2(value)           (DRMTCM_D0FLTSYN_ERR2_Msk & (_UINT32_(value) << DRMTCM_D0FLTSYN_ERR2_Pos)) /* Assigment of value for ERR2 in the DRMTCM_D0FLTSYN register */
#define DRMTCM_D0FLTSYN_Msk                   _UINT32_(0x0000C07F)                                 /* (DRMTCM_D0FLTSYN) Register Mask  */

#define DRMTCM_D0FLTSYN_ERR_Pos               _UINT32_(14)                                         /* (DRMTCM_D0FLTSYN Position) Double bit Error */
#define DRMTCM_D0FLTSYN_ERR_Msk               (_UINT32_(0x3) << DRMTCM_D0FLTSYN_ERR_Pos)           /* (DRMTCM_D0FLTSYN Mask) ERR */
#define DRMTCM_D0FLTSYN_ERR(value)            (DRMTCM_D0FLTSYN_ERR_Msk & (_UINT32_(value) << DRMTCM_D0FLTSYN_ERR_Pos)) 

/* -------- DRMTCM_D1FLTCAP : (DRMTCM Offset: 0x44) ( R/ 32) D1TCM FAULT ERROR CAPTURE ADDRESS REGISTER -------- */
#define DRMTCM_D1FLTCAP_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_D1FLTCAP) D1TCM FAULT ERROR CAPTURE ADDRESS REGISTER  Reset Value */

#define DRMTCM_D1FLTCAP_FLTADR_Pos            _UINT32_(0)                                          /* (DRMTCM_D1FLTCAP) Data 1 TCM ECC Fault Address bits which caused the ECC Error. Position */
#define DRMTCM_D1FLTCAP_FLTADR_Msk            (_UINT32_(0x1FFFF) << DRMTCM_D1FLTCAP_FLTADR_Pos)    /* (DRMTCM_D1FLTCAP) Data 1 TCM ECC Fault Address bits which caused the ECC Error. Mask */
#define DRMTCM_D1FLTCAP_FLTADR(value)         (DRMTCM_D1FLTCAP_FLTADR_Msk & (_UINT32_(value) << DRMTCM_D1FLTCAP_FLTADR_Pos)) /* Assigment of value for FLTADR in the DRMTCM_D1FLTCAP register */
#define DRMTCM_D1FLTCAP_D1TCMMASTER_Pos       _UINT32_(28)                                         /* (DRMTCM_D1FLTCAP) Master ID of the requester of the current Error access. Position */
#define DRMTCM_D1FLTCAP_D1TCMMASTER_Msk       (_UINT32_(0xF) << DRMTCM_D1FLTCAP_D1TCMMASTER_Pos)   /* (DRMTCM_D1FLTCAP) Master ID of the requester of the current Error access. Mask */
#define DRMTCM_D1FLTCAP_D1TCMMASTER(value)    (DRMTCM_D1FLTCAP_D1TCMMASTER_Msk & (_UINT32_(value) << DRMTCM_D1FLTCAP_D1TCMMASTER_Pos)) /* Assigment of value for D1TCMMASTER in the DRMTCM_D1FLTCAP register */
#define DRMTCM_D1FLTCAP_Msk                   _UINT32_(0xF001FFFF)                                 /* (DRMTCM_D1FLTCAP) Register Mask  */


/* -------- DRMTCM_D1FLTPAR : (DRMTCM Offset: 0x48) ( R/ 32) D1TCM FAULT PARITY REGISTER -------- */
#define DRMTCM_D1FLTPAR_RESETVALUE            _UINT32_(0x00)                                       /*  (DRMTCM_D1FLTPAR) D1TCM FAULT PARITY REGISTER  Reset Value */

